In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data = pd.read_csv('../data/merge.csv')

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16901 entries, 0 to 16900
Data columns (total 18 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Gender                    16901 non-null  object
 1   Education                 16901 non-null  object
 2   Income                    16901 non-null  float64
 3   Marital Status            16901 non-null  object
 4   LoyaltyStatus             16901 non-null  object
 5   Customer Lifetime Value   16901 non-null  float64
 6   EnrollmentType            16901 non-null  object
 7   year                      16901 non-null  int64
 8   month                     16901 non-null  int64
 9   day                       16901 non-null  int64
 10  cancel_year               2288 non-null   float64
 11  cancel_month              2288 non-null   float64
 12  tenure                    2288 non-null   float64
 13  NumFlights                16901 non-null  float64
 14  NumFlightsWithCompanions  16901 non-null  float64
 15  DistanceKM                16901 non-null  float64
 16  PointsAccumulated         16901 non-null  float64
 17  PointsRedeemed            16901 non-null  float64
dtypes: float64(10), int64(3), object(5)
memory usage: 2.3+ MB

In [5]:
2288/16901*100

13.537660493461926

- About 12.54% of the customer has already churned.

In [10]:
customer_churn = data[data['cancel_year'].notnull()]

In [11]:
customer_churn.shape

(2288, 18)

In [12]:
customer_churn.head()

,Gender,Education,Income,Marital Status,LoyaltyStatus,Customer Lifetime Value,EnrollmentType,year,month,day,cancel_year,cancel_month,tenure,NumFlights,NumFlightsWithCompanions,DistanceKM,PointsAccumulated,PointsRedeemed
2,male,College,0.0,Single,Star,3839.75,Standard,2017,7,14,2021.0,1.0,4.0,120.0,39.9,238376.1,23832.41,5479.6
19,female,College,0.0,Married,Star,3885.46,Standard,2017,10,23,2021.0,1.0,4.0,134.0,51.3,297077.4,29703.54,0.0
31,female,Bachelor,26605.0,Married,Star,3893.31,Standard,2018,4,6,2018.0,12.0,0.0,0.0,0.0,0.0,0.00,0.0
39,female,Bachelor,30821.0,Married,Star,3911.12,Standard,2020,3,8,2020.0,4.0,0.0,0.0,0.0,0.0,0.00,0.0
45,female,Bachelor,66676.0,Married,Star,3919.37,Standard,2019,6,3,2020.0,2.0,1.0,19.0,7.6,48560.2,4855.22,0.0

In [13]:
customer_churn.describe()

,Income,Customer Lifetime Value,year,month,day,cancel_year,cancel_month,tenure,NumFlights,NumFlightsWithCompanions,DistanceKM,PointsAccumulated,PointsRedeemed
count,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000,2288.000000
mean,37668.420017,8158.454178,2018.478584,6.361451,15.759178,2019.450175,6.705420,0.971591,45.171416,11.345760,89429.390559,8941.307893,2704.317657
std,30487.055915,7315.192359,1.679235,3.477461,8.835976,1.338005,3.466717,1.547831,59.033352,16.152827,116622.929960,11660.410623,5589.608323
min,0.000000,1898.680000,2016.000000,1.000000,1.000000,2015.000000,1.000000,-6.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,4064.670000,2017.000000,3.000000,8.000000,2019.000000,4.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,33806.000000,5764.650000,2018.000000,6.000000,16.000000,2020.000000,7.000000,1.000000,20.000000,3.000000,41366.000000,4135.000000,0.000000
75%,61974.500000,9033.855000,2020.000000,9.000000,23.000000,2021.000000,10.000000,1.000000,69.000000,18.000000,140657.475000,14062.972500,3783.000000
max,99961.000000,83325.380000,2021.000000,12.000000,31.000000,2021.000000,12.000000,5.000000,316.900000,102.800000,764356.200000,76425.720000,44462.300000

- About 25% of the churned customers have an income of 0, along with their number of flights, number of flights with companions, distance in km.

Churned customers exhibit relatively short tenure, with most leaving within the first year of enrollment, indicating early-life churn. While many churned customers show low engagement, a substantial subset demonstrates high flight activity and accumulated value, suggesting that churn is not solely driven by inactivity. The presence of high-CLV churned customers and large volumes of unredeemed points indicates potential dissatisfaction with reward redemption or program value. Overall, churn appears to be driven by both behavioral and structural factors rather than income alone.

In [17]:
customer_churn.describe(include=['object'])

        Gender Education Marital Status LoyaltyStatus EnrollmentType
count     2288      2288           2288          2288           2288
unique       2         5              3             3              2
top     female  Bachelor        Married          Star       Standard
freq      1175      1429           1340          1000           2153

In [20]:
pd.crosstab(customer_churn['cancel_year'], customer_churn['LoyaltyStatus'], normalize='index').round(2)

LoyaltyStatus  Aurora  Nova  Star
cancel_year
2015.0           0.00  1.00  0.00
2016.0           0.23  0.26  0.51
2017.0           0.25  0.33  0.42
2018.0           0.20  0.36  0.43
2019.0           0.21  0.34  0.45
2020.0           0.21  0.34  0.44
2021.0           0.22  0.36  0.42